openweave/openweave-core/src/adaptations/device-layer/nRF5/BLEManagerImpl.cpp
    // Form the contents of the scan response packet.
    memset(&serviceData, 0, sizeof(serviceData));
    serviceData.service_uuid = UUID16_WoBLEService;
    serviceData.data.size = sizeof(weaveServiceData);
    serviceData.data.p_data = (uint8_t *)&weaveServiceData;
    memset(&advData, 0, sizeof(advData));
    advData.name_type = BLE_ADVDATA_NO_NAME;
    advData.include_appearance = false;
    advData.p_service_data_array = &serviceData;
    advData.service_data_count = 1;
    gapAdvData.scan_rsp_data.p_data = mScanRespDataBuf;
    gapAdvData.scan_rsp_data.len = sizeof(mScanRespDataBuf);
    err = ble_advdata_encode(&advData, mScanRespDataBuf, &gapAdvData.scan_rsp_data.len);
    SuccessOrExit(err);

exit:
    return err;
}

uint16_t BLEManagerImpl::_NumConnections(void)
{
    uint16_t numCons = 0;
    for (uint16_t i = 0; i < kMaxConnections; i++)
    {
        if (mSubscribedConIds[i] != BLE_CONNECTION_UNINITIALIZED)
        {
            numCons++;
        }
    }
    return numCons;
}

void BLEManagerImpl::DriveBLEState(intptr_t arg)
{
    sInstance.DriveBLEState();
}

void BLEManagerImpl::HandleSoftDeviceBLEEvent(const WeaveDeviceEvent * event)
{
    WEAVE_ERROR err = WEAVE_NO_ERROR;
    const ble_evt_t * bleEvent = &event->Platform.SoftDeviceBLEEvent.EventData;

    WeaveLogDetail(DeviceLayer, "BLE SoftDevice event 0x%02x", bleEvent->header.evt_id);

    switch (bleEvent->header.evt_id)
    {
    case BLE_GAP_EVT_CONNECTED:
        err = HandleGAPConnect(event);
        SuccessOrExit(err);
        break;

    case BLE_GAP_EVT_DISCONNECTED:
        err = HandleGAPDisconnect(event);
        SuccessOrExit(err);
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // BLE Pairing not supported
        err = sd_ble_gap_sec_params_reply(bleEvent->evt.gap_evt.conn_handle,
                                          BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                          NULL,
                                          NULL);
        SuccessOrExit(err);
        break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
        WeaveLogProgress(DeviceLayer, "BLE GAP PHY update request (con %" PRIu16 ")", bleEvent->evt.gap_evt.conn_handle);
        const ble_gap_phys_t phys = { BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO };
        err = sd_ble_gap_phy_update(bleEvent->evt.gap_evt.conn_handle, &phys);
        SuccessOrExit(err);
        break;
    }

    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        err = sd_ble_gatts_sys_attr_set(bleEvent->evt.gatts_evt.conn_handle, NULL, 0, 0);
        SuccessOrExit(err);
        break;

    case BLE_GATTS_EVT_TIMEOUT:
        WeaveLogProgress(DeviceLayer, "BLE GATT Server timeout (con %" PRIu16 ")", bleEvent->evt.gatts_evt.conn_handle);
        err = sd_ble_gap_disconnect(bleEvent->evt.gatts_evt.conn_handle,
                                    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err);
        break;

    case BLE_GATTS_EVT_WRITE:
        // Handle the event if it is a write to the WoBLE TX CCCD attribute.  Otherwise simply
        // ignore it.
        if (bleEvent->evt.gatts_evt.params.write.handle == mWoBLECharHandle_TX.cccd_handle)
        {
            err = HandleTXCharCCCDWrite(event);
            SuccessOrExit(err);
        }
        break;

    case BLE_GATTS_EVT_HVC:
        err = HandleTXComplete(event);
        SuccessOrExit(err);
        break;

    default:
        break;
    }

exit:
    if (err != WEAVE_NO_ERROR)
    {
        WeaveLogError(DeviceLayer, "Disabling WoBLE service due to error: %s", ErrorStr(err));
        sInstance.mServiceMode = ConnectivityManager::kWoBLEServiceMode_Disabled;
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
}

void BLEManagerImpl::SoftDeviceBLEEventCallback(const ble_evt_t * bleEvent, void * context)
{
    WeaveDeviceEvent event;

    // NB: When NRF_SDH_DISPATCH_MODEL_INTERRUPT is enabled (the typical case), this method runs
    // in interrupt context.

    // If the event is a write event for the WoBLE RX characteristic value...
    if (bleEvent->header.evt_id == BLE_GATTS_EVT_WRITE &&
        bleEvent->evt.gatts_evt.params.write.handle == sInstance.mWoBLECharHandle_RX.value_handle)
    {
        PacketBuffer * buf;
        const uint16_t valLen = bleEvent->evt.gatts_evt.params.write.len;
        const uint16_t minBufSize = WEAVE_SYSTEM_PACKETBUFFER_HEADER_SIZE + valLen;

        // Attempt to allocate a packet buffer with enough space to hold the characteristic value.
        // Note that we must use pbuf_alloc() directly, as PacketBuffer::New() is not interrupt-safe.
        buf = (PacketBuffer *)(pbuf_alloc(PBUF_RAW, minBufSize, PBUF_POOL));

        // If successful...
        if (buf != NULL)
        {
            // Copy the characteristic value into the packet buffer.
            memcpy(buf->Start(), bleEvent->evt.gatts_evt.params.write.data, valLen);
            buf->SetDataLength(valLen);

            // Arrange to post a WoBLERXWriteEvent event to the Weave queue.
            event.Type = DeviceEventType::kWoBLERXCharWriteEvent;
            event.Platform.RXCharWriteEvent.ConId = bleEvent->evt.gatts_evt.conn_handle;
            event.Platform.RXCharWriteEvent.WriteArgs = bleEvent->evt.gatts_evt.params.write;
            event.Platform.RXCharWriteEvent.Data = buf;
        }

        // If we failed to allocate a buffer, post a kWoBLEOutOfBuffersEvent event.
        else
        {
            event.Type = DeviceEventType::kWoBLEOutOfBuffersEvent;
        }
    }

    else
    {
        // Ignore any events that are larger than a particular size.
        //
        // With the exception of GATT write events to the WoBLE RX characteristic, which are handled above,
        // all BLE events that Weave is interested are of a limited size, roughly equal to sizeof(ble_evt_t)
        // plus a couple of bytes of payload data.  Any event that is larger than this size and not handled
        // above must represent an event related to some *other* user of the BLE SoftDevice and therefore
        // can be safely ignored by Weave.
        VerifyOrExit(bleEvent->header.evt_len <= sizeof(event.Platform.SoftDeviceBLEEvent), /**/);

        // Ignore any write event for anything *other* than the WoBLE TX CCCD value.
        VerifyOrExit(bleEvent->header.evt_id != BLE_GATTS_EVT_WRITE ||
                     bleEvent->evt.gatts_evt.params.write.handle == sInstance.mWoBLECharHandle_TX.cccd_handle, /**/);

